dfe-stubs/src/main/resources/wsdl/nfe/mg/prod/status_service.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.2-1 git-revision#dbe58a8. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 2.3.2-1 git-revision#dbe58a8. -->
<definitions
        xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
        xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
        xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
        targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4" name="NFeStatusServico4">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4"
                        schemaLocation="https://nfe.fazenda.mg.gov.br:443/nfe2/services/NFeStatusServico4?xsd=1"/>
        </xsd:schema>
    </types>
    <message name="nfeStatusServicoNF">
        <part name="nfeDadosMsg" element="tns:nfeDadosMsg"/>
    </message>
    <message name="nfeStatusServicoNFResponse">
        <part name="nfeStatusServicoNFResult" element="tns:nfeResultMsg"/>
    </message>
    <portType name="NFeStatusServico4Soap">
        <operation name="nfeStatusServicoNF">
            <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4/nfeStatusServicoNF"
                   message="tns:nfeStatusServicoNF"/>
            <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4/NFeStatusServico4Soap/nfeStatusServicoNFResponse"
                    message="tns:nfeStatusServicoNFResponse"/>
        </operation>
    </portType>
    <binding name="NFeStatusServico4SoapBinding" type="tns:NFeStatusServico4Soap">
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="nfeStatusServicoNF">
            <soap12:operation
                    soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4/nfeStatusServicoNF"/>
            <input>
                <soap12:body use="literal"/>
            </input>
            <output>
                <soap12:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="NFeStatusServico4">
        <port name="NFeStatusServico4Soap" binding="tns:NFeStatusServico4SoapBinding">
            <soap12:address location="https://nfe.fazenda.mg.gov.br:443/nfe2/services/NFeStatusServico4"/>
        </port>
    </service>
</definitions>